app/views/topics/show.html.erb

<div class="comments_section">
  <% if @topic.comments.count < 1 %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."topic_id" = ?  [["topic_id", 1090785377]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."topic_id" = ?  [["topic_id", 1090785372]]