app/controllers/comments_controller.rb

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1090785377], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "body", "created_at", "updated_at", "topic_id") VALUES (?, ?, ?, ?, ?)
---
  def create
    @topic = Topic.find(params[:topic_id])
    @comment = @topic.comments.create(comment_params)