app/controllers/topics_controller.rb

  def index
    @page = params.fetch(:page, 0).to_i
    @topics = Topic.offset(@page * TOPICS_PER_PAGE).limit(TOPICS_PER_PAGE)
---
SELECT "topics".* FROM "topics" ORDER BY "topics"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "topics" LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 2], ["OFFSET", 2]]

  def edit
    @topic = Topic.find(params[:id])
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1090785373], ["LIMIT", 1]]

  def show
    @topic = Topic.find(params[:id])
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1090785377], ["LIMIT", 1]]

  def update
    @topic = Topic.find(params[:id])

    if @topic.update(topic_params)
---
UPDATE "topics" SET "updated_at" = ? WHERE "topics"."id" = ?  [["updated_at", "2022-09-20 22:27:40.386538"], ["id", 1090785355]]

  def create
    @topic = Topic.new(topic_params)

    respond_to do |format|
      if @topic.save
---
INSERT INTO "topics" ("title", "body", "created_at", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["title", "y"], ["body", nil], ["created_at", "2022-09-21 19:03:36.872675"], ["updated_at", "2022-09-21 19:03:36.872675"], ["username", "Pete"]]

  def create
    @topic = Topic.new(topic_params)

    if @topic.save
---
INSERT INTO "topics" ("title", "body", "created_at", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["title", "This is Not Spam"], ["body", nil], ["created_at", "2022-09-22 20:57:18.645500"], ["updated_at", "2022-09-22 20:57:18.645500"], ["username", "Guest"]]