app/models/user.rb

SELECT 1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "hashbrown"], ["LIMIT", 1]]
---
  def validate_username
    if User.where(email: username).exists?

SELECT "users".* FROM "users" WHERE (lower(username) = 'paper@paper.com' OR lower(email) = 'paper@paper.com') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def self.find_for_database_authentication(warden_conditions)
    conditions = warden_conditions.dup
    if login = conditions.delete(:login)
      where(conditions.to_h).where(["lower(username) = :value OR lower(email) = :value", { :value => login.downcase}]).first